{"tags":[{"name":"love","permalink":"https://egoist.moe/tags/love/","url":"/async/tags/love.json","count":1},{"name":"shangjiamin","permalink":"https://egoist.moe/tags/shangjiamin/","url":"/async/tags/shangjiamin.json","count":1}],"categories":[{"name":"life","permalink":"https://egoist.moe/categories/life/","url":"/async/categories/life.json","count":1}],"url":"/async/posts/2016/07/01/first-love.json","date":1467370257000,"path":{"year":2016,"month":7,"day":1,"name":"first-love"},"subtitle":"仅以某种形式的流水账纪念两年前的现在","title":"第一次恋爱","permalink":"https://egoist.moe/2016/07/01/first-love/","content":"<p>又是一年七月一日，然而这对我并不是一个有什么意义的日子。</p>\n<p>最近我的运气算是差到了极点，未来在牙科七进七出都不是梦了。而每到这种万物于我皆衰败的时候，我总是会纯情地想起她，不同于以往的是，我似乎已经被某些事折腾得累了，也逐渐想明白了一些，我不再讨厌她之前的决定，现在看来一切都是在科学的发展着。</p>\n<p>其实高中的时候我便不相信恋爱，同学间的懵懂情愫对我来说可有可无。就像我高中暗恋的她，有男朋友的她很喜欢笑，和男生打成一片，和他也如胶似漆，而我只是默默远观，并且这一切一直都没有改变，我的不存在没有改变任何事，一切都在开心地运转。</p>\n<p>话说男生喜欢一个女生最明显的表现就是喜欢和她对着干，很对，我教科书式得对着干让她没有注意到丝毫我对她的感情。</p>\n<p>看起来多么悲情和可怜的家伙啊，你以为我是这样？别，我的形象其实可以更高大。</p>\n<p>在高三最后半年，突然冒出两个喜欢我的女生，我使劲想了想却记不起她们的名字，至于样貌嘛，我从一开始就不太清楚。</p>\n<p>我对她们感到很抱歉，那段时间我的孤独症正值发病期，伴随着即将毕业再也看不见“她”的心情我用这两个女生打发了一段无聊的时光，虽然仅限于网络。</p>\n<p>她们还有个身份就是我隔壁班的同学，至于我对她们说“不”后她们夸张的反应，我也表示很遗憾，一切都是我的错。</p>\n<p>我之前暗恋的她还有她们似乎占了很大篇幅，其实我真正想说的是我大学的“她”，对，一切都只是引子而已。</p>\n<p>要说长相没人会说她很好看，我也不会。可我就是喜欢。我很惭愧我不能夸我喜欢的人好看，不能露出惊为仙女的表情，我只是默默按耐住内心躁动的情绪，要说唯一能想到的形容词，那就是「百看不厌」。</p>\n<p>多么可笑的故事开局，所谓「百看不厌」是一种喜欢吗，我完全不知道。不过我很庆幸她有所回应，或者更客观地说是「没有拒绝」，就这样我学校生涯最开心的几个月开始了。第一次恋爱我很手足无措，面对她的时候显得很幼稚，虽然也许行为上并没有表现出来，因为我看着比较木讷，但内心其实是在拼命掩盖着。</p>\n<p>那是在一年暑期的前几个月，我常常在傍晚约她去操场散步，女生宿舍就在体育场旁边，因此每次我过去都可以看到她在等我。哦不，是我记错了，每次我去的时候她都还没有下楼。不过还好，每次看见她走出宿舍她都在笑，她笑的时候眼睛会显得更小，似乎面部所有部位都在抒发感情。而我和她在操场上最难忘的是两件事，一是她经常用我的手机玩游戏，而我就在旁边看她玩，因为这个我学会了植物大战僵尸；二是某次我和她坐在足球场的球门附近，突然一个不认识的人跑了过来问我要电话号码，事后我才意识到她是和附近的几个人玩真心话大冒险输了，该死。</p>\n<p>还有什么值得回忆的事吗，尽管只过了一两年有些事我也记不太清了，不过大部分都可以一句话带过——周末我有时会约她去图书馆看书，玩电脑，刚巧那个时候我们都看《吸血鬼日记》和《行尸走肉》，我就和她在图书馆一起看了一段，然而效果并不理想；她四级考试连挂两次之后我陪她去买习题；周末她会去附近的沃尔玛采购食物，所以有几次我因为这个找借口在周末留在学校，为了能陪她一起去；有次班上一起出去玩，刚巧我每个月有几天心情很不好，我就一个人躺在巴士的最后一排，她和其他人玩得很开心，由于我穿着短裤躺着，不方便揣钥匙，所以我让她帮我拿一下钥匙，计划通，这种感觉挺好……</p>\n<p>说了一堆可有可无的小事，只有最后一件是我差点忘了的。那是暑假之前我们最后一天在学校，我收拾好行李准备回家了，忘了什么原因，似乎是刚好顺路，在回家之前我可以陪她坐一段地铁。平淡无奇的事，不过能够看到她「在地铁上的样子」也算某种程度上的「第一次」。之后换乘的时候我们路线相反，因此分道扬镳了。再出了地铁口之后，天上下起了蒙蒙细雨，一个路人甲走了过来问能不能买我的伞，我却直接送给了她，怪我毫无预见性，不一会儿小于就变成了十分变态的大雨。回到家之后我告诉了她这件事，我能想象到屏幕那边她的笑脸。</p>\n<p>没想到暑假回来，她有了男朋友，是她青梅竹马的高中同学。我甚至忘了我是怎么知道这一事实的，她说她其实一直喜欢他，只是他有女朋友，她是在等。慢着，我是不是听错了，好吧没有。之后的事我就不想再描述了，不过这些「不可描述的事」中有一件是某次我在食堂中央区域吃饭，她牵着男朋友进了食堂，她很明显没注意到我，然后和男朋友走向了二楼。</p>\n<p>在那之后的一年里，我都想知道为什么，虽然原因也许根本不重要，我也只是想有个充分的让我放弃的理由。最开始我难以接受，她会这样对我上帝能想到吗，我让自己讨厌她以此来证实她的决定是对的，真可怜啊，从来没有被接受却要承受被拒绝的心情。如果从一开始她就不给我任何回应就好了，不努力考零分和没日没夜学习最后考了 59 分还是后者来的伤害更大。不过能怪她吗，毕竟是同班同学，直接拒绝了我恐怕也很尴尬。</p>\n<p>WTF? 似乎最开始我表白才是最大的错?这是我第一次想拥有哆啦A梦。</p>\n<hr>\n<p>有些人在描述自己「不可描述经历」的时候往往会写出流水账，因为那个时候他们势必会参杂着某些难以抑制的感情，很难像黄健翔那样酒后激情洋洋洒洒脱口而出「……伟大的意大利！伟大的意大利的左后卫！马尔蒂尼，今天生日快乐！意大利万岁！」。</p>\n<p>你之所以能看到这样一篇抑扬顿挫的抒情散文，完全是因为我已经拥有了二次元的爱，对那些狗屁的三次元恋爱毫无留恋。</p>\n<p><img src=\"https://o68eee1f9.qnssl.com/16-7-1/26410635.jpg\" alt=\"fuck\"></p>\n"}