{"tags":[{"name":"vue","permalink":"https://egoist.moe/tags/vue/","url":"/async/tags/vue.json","count":4},{"name":"webpack","permalink":"https://egoist.moe/tags/webpack/","url":"/async/tags/webpack.json","count":2}],"categories":[],"url":"/async/posts/2017/02/15/vbuild.json","date":1487158586000,"path":{"year":2017,"month":2,"day":15,"name":"vbuild"},"subtitle":"Developing Vue.js app is like 1,2,3","title":"vbuild","permalink":"https://egoist.moe/2017/02/15/vbuild/","content":"<p>I’m very proud to announce <a href=\"https://github.com/egoist/vbuild\" target=\"_blank\" rel=\"external\">vbuild 6</a>, an opinionated but configurable Webpack wrapper for bundling front-end Vue.js apps, allowing you to use Webpack like a pro! No decision-making while reducing boilerplate code, solving problems like when to split vendor code, how to manage static files, CSS extracting et al.</p>\n<img class=\"border-image\" src=\"https://ooo.0o0.ooo/2017/02/17/58a6cc0680006.png\" alt=\"preview\">\n<p>To start using, all you need is to write your app directly, let’s say <code>index.js</code>:</p>\n<pre><code class=\"language-jsx\">import Vue from 'vue'\n\nnew Vue({\n  el: '#app',\n  render: h =&gt; &lt;h1&gt;Hello World!&lt;/h1&gt;\n})\n</code></pre>\n<p>Without <code>vbuild</code>, you need to create a <code>webpack.config.js</code> with a lot of boilerplate code, and install many dev dependencies in <code>package.json</code>, which is very verbose to perform.</p>\n<p>Now we can run a single command <code>vbuild --dev</code> to replace the process above.</p>\n<p>This blog post will go into the philosophy and design decisions of the project. To learn how to use vbuild instead, please refer to the <a href=\"https://github.com/egoist/vbuild#readme\" target=\"_blank\" rel=\"external\">README</a>, where you can learn the entirety of the tool’s capabilities in just a few minutes.</p>\n<p>First we’ll dive into the <a href=\"#background\">background</a> of this project.</p>\n<h2 id=\"background\">Background</h2>\n<p>In the past few years, bundlers like Webpack and browserify have taken over the market. Before that, Gulp had just made some progress in the process of replacing Grunt as the major build tool of front-end assets.</p>\n<p>The main reason that Gulp is replacing Grunt is the <strong>simplicity</strong> in my opinion. Who knows that I had been using PHP for years before meeting Node.js, developing and deploying PHP apps is that stupidly fast and easy.</p>\n<p>Since then, I’ve made my mind that I want to develop JavaScript apps in a simple way. At the same time, I did fall in love with <a href=\"https://github.com/sindresorhus/xo\" target=\"_blank\" rel=\"external\">XO</a>, which is an ESLint wrapper that reduces the overhead of managing config files. vbuild is to Webpack as XO is to ESLint.</p>\n<h2 id=\"why-vue-js\">Why Vue.js</h2>\n<p>There’re similar tools like <a href=\"https://github.com/insin/nwb\" target=\"_blank\" rel=\"external\">nwb</a> or <a href=\"https://github.com/facebookincubator/create-react-app\" target=\"_blank\" rel=\"external\">create-react-app</a>, but vbuild is mainly for Vue.js.</p>\n<p>Despiting that vbuild has extra support for Vue’s single-file component, it actually works for all kinds of JavaScript frameworks! The <strong>no-config</strong> feature works better in Vue.js apps though.</p>\n<p>Have to note that, Vue.js itself is getting well with the idea <strong>no-config</strong>, you can use it directly in a <code>index.html</code> file, or work with any bundler, out-of-box nice development experience, hot-code reloading support, officially maintained router and state-managament library.</p>\n<h2 id=\"future\">Future</h2>\n<p>I do have some exciting future plans for vbuild, like <a href=\"https://github.com/egoist/vbuild/issues/112\" target=\"_blank\" rel=\"external\">server-side rendering support</a> (I know there’s Nuxt.js already) and better testing experience for Vue.js app.</p>\n<p>Currently you can see vbuild’s <code>run</code> option, which allows you to perform custom build process instead of running webpack:</p>\n<pre><code class=\"language-js\">module.exports = {\n  run(webpackConfig) {\n    // Your custom logic...\n  }\n}\n</code></pre>\n<p>If you’re interested in contributing, please join the party, check out the <a href=\"https://github.com/egoist/vbuild/issues\" target=\"_blank\" rel=\"external\">issue tracker</a> or contact me personally on Twitter <a href=\"https://twitter.com/rem_rin_rin\" target=\"_blank\" rel=\"external\">@rem_rin_rin</a>.</p>\n"}